<a href="https://colab.research.google.com/github/seoin-cho/SOLUX_summer_data/blob/master/1%2C2%EC%A3%BC%EC%B0%A8_%ED%8C%AC%EB%8D%94%EC%8A%A4/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_1~6_(2020_07_23).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
data_frame = pd.read_csv('data/friend_list.csv')  # csv 파일 불러오는 방법
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
data_frame.head()  #상위 5개의 행만 불러옴

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [ ]:
data_frame.head(2) #상위 2개의 행만 불러옴

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [ ]:
data_frame.tail(2)  #하위 2개의 행만 불러옴

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [ ]:
type(data_frame.name) #각 column들의 type은 Series임. Series가 모여 table을 만드는 것!

pandas.core.series.Series

In [ ]:
s1 = pd.core.series.Series([1,2,3])
s2 = pd.core.series.Series(['one', 'two', 'three'])
pd.DataFrame(data=dict(num=s1, word=s2))
#list로 Series를 만들고, Series들이 모여 table을 만듦

   num   word
0    1    one
1    2    two
2    3  three

In [ ]:
df = pd.read_csv('data/friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df = pd.read_csv('data/friend_list_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [ ]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter='\t')  # ','가 아닌 tab으로 작성된 파일의 경우,delimiter를 지정해준다
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df = pd.read_csv('data/friend_list_no_head.txt')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [ ]:
df = pd.read_csv('data/friend_list_no_head.txt', header = None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [ ]:
df.columns = ['name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df = pd.read_csv('data/friend_list_no_head.txt', header = None, names=['name', 'age', 'job'])  #header가 없을 경우 한 번에 header를 만들어주는 방법
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
# 딕셔너리로 테이블을 만드는 방법 (column 순서가 원하는대로 배열되지 않을 수 있음)
import pandas as pd
friend_dict_list = [
   {'name':'John', 'age':20, 'job':'student'},
   {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friend_dict_list)
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
df = df[['name', 'age', 'job']]  #column 순서 지정
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
# column을 원하는 순서로 배열하는 방법
# OrderedDict
from collections import OrderedDict
friend_ordered_dict = OrderedDict(
    [
     ('name', ['John', 'Nate']),
     ('age', [20, 30]),
     ('job', ['student', 'teacher'])
]
)
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
# list로 테이블을 만드는 방법
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']               
]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
#OrderedDict의 또 다른 방법
from collections import OrderedDict
friend_list = [
               ['name', ['John','Nate']],
               ['age', [20, 30]],
               ['job', ['student', 'teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
friends= [
               ['John', 20, 'student'],
               ['Nate', 30, 'teacher']
]
column_name = ['name', 'age', 'job']
df = pd.DataFrame(friends, columns = column_name)
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
df.to_csv('friend.csv')

In [ ]:
df.to_csv('friend.csv', index=True, header=True) #'index=True'와 'header=True'는 디폴트 값

In [ ]:
df.to_csv('friend.csv', index=False, header=True) # index가 필요 없으면 'index=False'

In [ ]:
df.to_csv('friend.csv', index=False, header=False) # header가 필요 없으면 'header=False'

In [ ]:
friends = [
           {'name':'John', 'age':20, 'job':'student'},
           {'name':'Jenny', 'age':20, 'job':None},
           {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friends)
df.to_csv('friends.csv', na_rep='-') #csv파일로 만드는 법  #빈칸(None)을 '-'로 표시하려면 na_rep='-'

In [ ]:
import pandas as pd
from collections import OrderedDict
friends = [
           ['name', ['John', 'Jenny', 'Nate']],
           ['age', [20, 30, 30]],
           ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame(OrderedDict(friends))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[1:3] # 슬라이싱을 통해 원하는 행만 추출

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df = df[1:3] # 원하는 행만 남기는 방법
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
import pandas as pd
from collections import OrderedDict
friends = [
           ['name', ['John', 'Jenny', 'Nate']],
           ['age', [20, 30, 30]],
           ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame(OrderedDict(friends))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.loc[[0,2]] #.loc[] 을 통해 원하는 행만 추출하는 방법

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
import pandas as pd
from collections import OrderedDict
friends = [
           ['name', ['John', 'Jenny', 'Nate']],
           ['age', [20, 30, 30]],
           ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame(OrderedDict(friends))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[df.age>25] #특정 조건을 만족하는 행만 추출하는 방법1

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.query('age > 25') #특정 조건을 만족하는 행만 추출하는 방법2

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[(df.age>25) & (df.name == 'Nate')] #2가지 이상의 조건을 만족하는 행만 추출하는 방법

   name  age      job
2  Nate   30  teacher

In [ ]:
import pandas as pd
friend_list = [
               ['John', 20, 'student'],
               ['Jenny', 30, 'developer'],
               ['Nate', 30, 'teacher']
               ]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [ ]:
df.iloc[:, 0:2] #.iloc[]으로 원하는 column을 추출하는 방법

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [ ]:
df.iloc[0:2, 0:2] #원하는 행과 열을 추출하는 방법

       0   1
0   John  20
1  Jenny  30

In [ ]:
df = pd.read_csv('/friend_list_no_head.csv', header=None, names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
#column 이름을 이용해 추출하는 방법1
df_filtered = df[['name', 'age']] 
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
#column 이름을 이용해 추출하는 방법2
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [ ]:
#특정 조건을 만족하는 column을 추출하는 방법
df.filter(like = 'a', axis=1) #이름에 'a'가 포함되어 있는 column만 추출  #'axis=1'은 열, 'axis=0'은 행

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df.filter(regex = 'b$', axis=1) #column name이 'b'로 끝나는 column 추출

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [ ]:
df.filter(regex='e$', axis=1) #column name이 'e'로 끝나는 column 추출

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
import pandas as pd
friends = [
           {'age':15, 'job':'student'},
           {'age':25, 'job':'developer'},
           {'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friends, index=['John', 'Jenny', 'Nate'], columns=['age', 'job']) #한 번에 index와 column 만듦
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [ ]:
df.drop(['John', 'Nate']) #index 이름을 이용해 특정 행을 버리는 방법

       age        job
Jenny   25  developer

In [ ]:
df = df.drop(['John', 'Nate']) #변경한 테이블로 바꾸는 방법

In [ ]:
df

       age        job
Jenny   25  developer

In [ ]:
friends = [
           {'age':15, 'job':'student'},
           {'age':25, 'job':'developer'},
           {'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friends, index=['John', 'Jenny', 'Nate'], columns=['age', 'job'])
df.drop(['John', 'Nate'], inplace = True) #위와 같이 따로 변경해 줄 필요없이 바로 변경하는 방법 #inplace=True #inplace=False가 디폴트
df

       age        job
Jenny   25  developer

In [ ]:
friends = [
           {'name':'John', 'age':15, 'job':'student'},
           {'name':'Jenny', 'age':25, 'job':'developer'},
           {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friends)
df = df.drop(df.index[[0,2]])  #인덱스를 이용해 특정 행을 버리는 방법
df

    name  age        job
1  Jenny   25  developer

In [ ]:
friends = [
           {'name':'John', 'age':15, 'job':'student'},
           {'name':'Ben', 'age':25, 'job':'developer'},
           {'name':'Jenny', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df = df[df.age>20]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df = df.drop('age', axis=1)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [ ]:
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df.drop('age', axis=1, inplace=True) #'inplace=True'를 이용해 df를 바로 변경
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher